Repository: br-automation-com/mapp-Framework
Catalog: BaseProject/Logical/mappView/Resources/Texts/mappFrameworkTexts/UserXPageTexts.tmx
Source language: en
Languages: de, zh, zh_cn

source: Active User
de: Aktiver Nutzer
zh: 当前用户
zh_cn: 当前用户

source: Add User
de: Benutzer hinzufügen
zh: 添加用户

source: Assign Role
de: Rolle zuweisen
zh: 角色添加

source: Cancel
de: Stornieren
zh: 取消

source: Change Password
de: Passwort ändern
zh: 修改密码
zh_cn: 修改密码

source: Confirm
de: Bestätigen Sie
zh: 确认

source: Confirm Password
de: Bestätige das Passwort
zh: 确认密码

source: Current Password
de: Aktuelles Passwort
zh: 当前密码

source: CurrentUser
de: Aktueller Benutzer
zh: 当前用户

source: Delete User
de: Benutzer löschen
zh: 用户删除
zh_cn: 用户删除

source: Edit User
de: Benutzer bearbeiten
zh: 编辑用户

source: Export User Group
de: Benutzergruppe exportieren
zh: 导出用户组

source: Export File Name
de: Dateiname exportieren
zh: 导出文件名称

source: Export Users
de: Benutzer exportieren
zh: 导出用户

source: Import User Group
de: Benutzergruppe importieren
zh: 导入用户组

source: File List
de: Dateiliste
zh: 文件列表

source: Selected File:
de: Ausgewählte Datei:
zh: 选择文件:

source: Import Roles
de: Rollen importieren
zh: 导入角色

source: Import Users
de: Benutzer importieren
zh: 导入用户

source: User settings
de: Benutzereinstellungen
zh: 用户设置

source: Last Login
de: Letzte Anmeldung
zh: 上次登录

source: Login
de: Anmeldung
zh: 登录
zh_cn: 登录

source: Logout
de: Ausloggen
zh: 退出
zh_cn: 退出

source: New Password
de: Neues Kennwort
zh: 新密码

source: New User Name
de: Neuer Benutzername
zh: 新用户名称
zh_cn: 新用户名称

source: Password
de: Passwort
zh: 密码
zh_cn: 密码

source: Refresh
de: Aktualisierung
zh: 刷新
zh_cn: 刷新

source: Remove Role
de: Rolle entfernen
zh: 角色删除

source: Rename
de: Umbenennen
zh: 用户重 命名
zh_cn: 用户重 命名

source: Repeat
de: Wiederholen
zh: 重复一遍
zh_cn: 重复 一 遍

source: Role
de: Rolle
zh: 角色

source: Role Options
de: Rollenoptionen
zh: 角色可选

source: User
de: Benutzer
zh: 用户
zh_cn: 用户

source: Everyone
de: Jeder
zh: 任何人
zh_cn: Jeder

source: Full Name:
de: Vollständiger Name:
zh: 全名:
zh_cn: Vollständiger Name:

source: Language
de: Sprache
zh: 语言

source: German
de: Deutsch
zh: 德语

source: English
de: Englisch
zh: 英语

source: Chinese
de: Chinesisch
zh: 中文

source: Maintenance
de: Instandhaltung
zh: 维护者
zh_cn: Instandhaltung

source: Measurement Unit
de: Maßeinheit
zh: 计量单位

source: Metric
de: Metrisch
zh: 公制

source: User Name:
de: Nutzername:
zh: 用户名:
zh_cn: Nutzername:

source: None
de: Keiner
zh: 无
zh_cn: Keiner

source: Password:
de: Passwort:
zh: 密码:
zh_cn: Passwort:

source: Password Confirm:
de: Passwortbestätigung:
zh: 密码确认:
zh_cn: Passwortbestätigung:

source: User Role Selection
de: Auswahl der Benutzerrolle
zh: 用户角色选择:
zh_cn: Auswahl der Benutzerrollen

source: Supervisor
de: Aufsicht
zh: 主管

source: UserInformation
de: Nutzerinformation
zh: 用户信息

source: User Management
de: Benutzerverwaltung
zh: 用户管理
zh_cn: 用户管理

source: User Name
de: Nutzername
zh: 用户
zh_cn: 用户

source: No Error
de: Kein Fehler
zh: 无错误

source: The specified password is invalid.
de: Das angegebene Passwort ist ungültig.
zh: 密码错误

source: The specified user does not exist.
de: Der angegebene Benutzer existiert nicht.
zh: 用户名错误

source: The specified user already exists.
de: Der angegebene Benutzer existiert bereits.
zh: 该用户已存在

source: The login token being used is invalid for the specified user.
de: Das verwendete Anmeldetoken ist für den angegebenen Benutzer ungültig.
zh: 验证码错误

source: User has no administrator rights.
de: Benutzer hat keine Administratorrechte.
zh: 抱歉，当前用户无访问权限

source: The user has insufficient access rights for the desired operation.
de: Der Benutzer hat keine ausreichenden Zugriffsrechte für die gewünschte Operation.
zh: 抱歉，当前用户无访问权限

source: The specified role does not exist.
de: Die angegebene Rolle existiert nicht.
zh: 用户组不存在

source: The specified password is not strong enough.
de: Das angegebene Passwort ist nicht stark genug.
zh: 密码安全度过低

source: This user is blocked.
de: Dieser Benutzer ist gesperrt.
zh: 该用户已冻结

source: The user must change the password before any additional functions can be carried out.
de: Der Benutzer muss das Passwort ändern, bevor zusätzliche Funktionen ausgeführt werden können.
zh: 完成该操作请先更改密码

source: The user has entered an incorrect password too often and has been blocked.
de: Der Benutzer hat zu oft ein falsches Passwort eingegeben und wurde gesperrt.
zh: 输入错误密码次数过多，该用户已冻结

source: The logged in user has no administrator rights.
de: Der angemeldete Benutzer hat keine Administratorrechte.
zh: 当前用户无管理员权限

source: User management is already in place for this group. An additional instance for this function block is not possible.
de: Für diese Gruppe ist bereits eine Benutzerverwaltung eingerichtet. Eine zusätzliche Instanz für diesen Funktionsbaustein ist nicht möglich.
zh: 该用户组的管理项不可更改

source: No user is logged in.
de: Es ist kein Benutzer angemeldet.
zh: 请先登录

source: The index for the selected function exceeds the maximum index; rights cannot be queried (reserved for future use).
de: Der Index für die ausgewählte Funktion überschreitet den maximalen Index; Rechte können nicht abgefragt werden (reserviert für zukünftige Verwendung).
zh: 该功能需要管理员权限

source: The new and old passwords are the same.
de: Das neue und das alte Passwort sind gleich.
zh: 新密码与旧密码重复

source: The specified username already exists.
de: Der angegebene Benutzername existiert bereits.
zh: 该用户已存在

source: The selected user could not be deleted. See the logger for additional information.
de: Der ausgewählte Benutzer konnte nicht gelöscht werden. Weitere Informationen finden Sie im Logger.
zh: 该用户无法删除，详情请查看Logger

source: The password is expired and must be changed.
de: Das Passwort ist abgelaufen und muss geändert werden.
zh: 密码已过期，请设置新密码

source: An invalid role name (NULL) was specified.
de: Es wurde ein ungültiger Rollenname (NULL) angegeben.
zh: 无法选择该用户组

source: The specified user is already logged in.
de: Der angegebene Benutzer ist bereits angemeldet.
zh: 该用户已登录

source: NULL was appended to "UIConnect".
de: NULL wurde an "UIConnect" angehängt.
zh: UI界面输入了无效值

source: An invalid username (NULL) was specified.
de: Es wurde ein ungültiger Benutzername (NULL) angegeben.
zh: 用户名错误

source: No password was entered.
de: Es wurde kein Passwort eingegeben.
zh: 没有密码

source: Function block MpUserXLogin is missing or not configured correctly.
de: Funktionsbaustein MpUserXLogin fehlt oder ist nicht richtig konfiguriert.
zh: MpUserXLogin功能块缺失或配置错误

source: The password entered for confirmation does not match the new password.
de: Das zur Bestätigung eingegebene Passwort stimmt nicht mit dem neuen Passwort überein.
zh: 再次输入的密码不符

source: The specified system right was not found (reserved for future use).
de: Das angegebene Systemrecht wurde nicht gefunden (reserviert für zukünftige Verwendung).
zh: 无法找到指定的系统权限（该权限为备用权限）

source: The import of user groups and/or user data failed. See the logger for additional information.
de: Der Import von Benutzergruppen und/oder Benutzerdaten ist fehlgeschlagen. Weitere Informationen finden Sie im Logger.
zh: 用户或用户组权限导入失败。详情请查看Logger

source: An error occurred while loading the import file. See the logger for additional information.
de: Beim Laden der Importdatei ist ein Fehler aufgetreten. Weitere Informationen finden Sie im Logger.
zh: 加载导入文件出现错误。详情请查看Logger

source: An error occurred while saving the export file. See the logger for additional information.
de: Beim Speichern der Exportdatei ist ein Fehler aufgetreten. Weitere Informationen finden Sie im Logger.
zh: 保存输出文件出现错误。详情请查看Logger

source: The name entered for the role is too long (>50 characters).
de: Der für die Rolle eingegebene Name ist zu lang (>50 Zeichen).
zh: 用户组名过长

source: The name entered for the user is too long (>20 characters).
de: Der für den Benutzer eingegebene Name ist zu lang (>20 Zeichen).
zh: 用户名过长

source: The password entered is too long (>20 characters).
de: Das eingegebene Passwort ist zu lang (>20 Zeichen).
zh: 密码过长

source: This component can only become active if MpUserXLogin is active.
de: Diese Komponente kann nur aktiv werden, wenn MpUserXLogin aktiv ist.
zh: 用户系统未激活

source: The username entered is too short
de: Der eingegebene Benutzername ist zu kurz
zh: 用户名过短

source: The specified role already exists.
de: Die angegebene Rolle existiert bereits.
zh: 指定的用户组已存在

source: Maximum number of signature attempts exceeded. The signature procedure was interrupted.
de: Maximale Anzahl an Signaturversuchen überschritten. Der Signaturvorgang wurde unterbrochen.
zh: 电子签名错误次数到达上限，无法继续尝试电子签名

source: The entered password has already been used and cannot be specified again.
de: Das eingegebene Passwort wurde bereits verwendet und kann nicht erneut vergeben werden.
zh: 新密码与旧密码一致，请重新输入新密码

source: The file being imported has an invalid format.
de: Die importierte Datei hat ein ungültiges Format.
zh: 导入的文件格式无效

source: Confirm User Deletion
de: Bestätigen Sie die Benutzerlöschung
zh: 确认删除该用户？

source: Confirm User Locking
de: Bestätigen Sie die Benutzersperre
zh: 确认锁定该用户？

source: Confirm User Unlocking
de: Bestätigen Sie das Entsperren des Benutzers
zh: 确认解锁该用户？

source: Password length insuffiencent
de: Passwortlänge unzureichend
zh: 密码长度不足

source: Alpha-numeric requirements not met
de: Alphanumerische Anforderungen nicht erfüllt
zh: 密码须包含字母和数字

source: Upper and lower case characters required
de: Groß- und Kleinschreibung erforderlich
zh: 密码须包含大小写字母

source: Password must contain special characters
de: Das Passwort muss Sonderzeichen enthalten
zh: 密码须包含特定字符

source: Administrator
zh: 管理员

source: Imperial
zh: 英制

source: Imperial-US
zh: 英制-US

source: Operator
zh: 操作者

source: A new signature was started before the last signed action was executed.
zh: 本次电子签名未完成，请勿开启新的电子签名

source: Confirm Role Deletion
zh: 确认删除该用户组？
